pmo-dataset/variations/graphviz_with_ids/45.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="customer waits until\nbank confirms\npayment"];
  "Service_1" [label="customer credentials\nbeing checked by\nsystem"];
  "Service_2" [label="Payment is prepared\nby system"];
  "Service_3" [label="Shipment is prepared\nby system"];
  "Service_4" [label="order is being\nfinished by system"];
  "Manual_1" [label="customer logs into\nE-Shop"];
  "Manual_2" [label="customer selects a\nproduct"];
  "Manual_3" [label="customer adds\nproduct to shopping\ncart"];
  "Manual_4" [label="customer saves\nproduct"];
  "Manual_5" [label="customer checks if\nproduct was already\nselected"];
  "Manual_6" [label="customer enters\npayment data"];
  "Manual_7" [label="customer enters\nshipping address"];
  "Manual_8" [label="customer enters an\nindependent billing\nadress"];
  "StartNoneEvent_1" [shape=circle, label="Open E-Shop Homepage"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Close E-Shop\nHomepage"];
  "ExclusiveGateway_1" [shape=diamond, label="succesful login?"];
  "ExclusiveGateway_2" [shape=diamond, label="has customer\nselected all desired\nproducts?"];
  "ExclusiveGateway_3" [shape=diamond, label="if shipping adress\n== billing adress?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "Manual_1";
  "Manual_1" -> "Service_1";
  "Service_1" -> "ExclusiveGateway_1";
  "Manual_2" -> "Manual_3";
  "Manual_3" -> "Manual_4";
  "Manual_4" -> "Manual_5";
  "Manual_5" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Service_2";
  "ParallelGateway_1" -> "Service_3";
  "ParallelGateway_2" -> "Service_4";
  "Manual_6" -> "ParallelGateway_3";
  "Service_2" -> "ParallelGateway_4";
  "Service_3" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Manual_6";
  "ParallelGateway_3" -> "Manual_7";
  "Manual_7" -> "ExclusiveGateway_3";
  "Manual_8" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="Yes"];
  "ExclusiveGateway_3" -> "Manual_8" [label="No"];
  "ExclusiveGateway_2" -> "ParallelGateway_1" [label="Yes"];
  "Service_4" -> "ExclusiveGateway_5";
  "ExclusiveGateway_5" -> "EndNoneEvent_1";
  "ExclusiveGateway_6" -> "Manual_2";
  "ExclusiveGateway_1" -> "ExclusiveGateway_6" [label="Yes"];
  "ParallelGateway_3" -> "Task_1";
  "Task_1" -> "ParallelGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_6" [label="No"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_5" [label="No"];
}
